#+TITLE: 列表
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: 2018-10-23
#+TAGS: python programming list


#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :session default
  nums = [1, 2, 3, 4, 5, 6, 7]
  nums[-3:]
  start = 1; end = 7; step  = 2
  nums[start:end:step]
#+END_SRC

#+RESULTS:
| 2 | 4 | 6 |


#+BEGIN_SRC python :preamble "# -*- coding: utf-8 -*-" :session default
  x = [1, 2, 3]
  y = x
  x.append(4)
  y #>>> [1, 2, 3, 4]
  x #>>> [1, 2, 3, 4]
  from copy import copy
  y = copy(x)
  x.append(5)
  x #>>> [1, 2, 3, 4, 5]
  y #>>> [1, 2, 3, 4]

  greeting = 'Hello'
  'x' in greeting #>>> False
  'l' in greeting #>>> True
  len(greeting) #>>> 5
  min(greeting) #>>> H

  # important skill
  numbers = [1, 5]
  numbers[1:1] = [2, 3, 4]
  # add elements by assign
  numbers #>>> [1, 2, 3, 4, 5]
  # delete elements by assign empty list
  numbers[-3:] = []
  numbers #>>> [1, 2]

  lst = [1, 2, 3]
  lst.append(4) 
  lst #>>> [1, 2, 3, 4]
  clist = [1, 2, 1, 3, 4, 2, 1]
  clist.count(1) #>>> 3
  a = [1, 2, 3]; b = [5, 7]
  a.extend(b)
  a #>>> [1, 2, 3, 5, 7]
  friuts = ['apple', 'banana', 'orange']
  friuts.index('orange') #>>> 2
  friuts.insert(1, 'pear')
  friuts #>>> ['apple', 'pear', 'banana', 'orange']
  friuts.pop()
  friuts #>>> ['apple', 'pear', 'banana']
  friuts.remove('apple')
  friuts #>>> ['pear', 'banana']
  x = [4, 6, 2, 1, 0, 6]
  x.reverse()
  x #>>> [6, 0, 1, 2, 6, 4]
  y = sorted(x) # return a sorted copy to y
  y #>>> [0, 1, 2, 4, 6, 6]
  x.sort() # return None
  x #>>> [0, 1, 2, 4, 6, 6]
  friuts = ['apple', 'pear', 'banana', 'orange']
  friuts.sort(key=len)
  friuts #>>> ['pear', 'apple', 'banana', 'orange']
#+END_SRC

#+RESULTS:
| pear | apple | banana | orange |
